<template>
  <div class="orbita">
    <div>
      <md-table>
        <md-table-header>
          <md-table-row>
            <!--<md-table-head v-for="(header) in dataOrbitaHeaders">{{header}}</md-table-head>-->
            <md-table-head v-for="hdr in dataOrbitaHeaders">{{hdr}}</md-table-head>
          </md-table-row>
        </md-table-header>
        
        <md-table-body>
          <md-table-row v-for="rowOrbita in dataOrbita">
            <md-table-cell v-for="cellOrbita in rowOrbita">{{cellOrbita}}</md-table-cell>
          </md-table-row>
        </md-table-body>
      </md-table>
    </div>
  </div>
</template>
<script>
  export default {
    mounted: function () {
      let self = this;
      self.dataOrbitaHeaders = [];
      self.getData();
    },
    name: 'orbita',
    data() {
      return {
        dataOrbita: [
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "",
            "Район/Улица:": "Центр- у моря - ул. Бальфур,Бат ям.",
            "Комнаты:": "3",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "1000 шек.",
            "fullText": "Я НЕ МАКЛЕР - нет никакой дополнительной платы кроме арендной, а также нет залога. \n\n••• просторные комнаты только для пар или двух женщин на улице Бальфур и Арлозоров. Центр Бат Яма, вблизи моря. 1000-1200 шек за одного человека. В комнате - большой холодильник, мебель, интернет. Все коммунальные включены в цену. \n\nДля мужчин - 900-1000шек для одного человека в комнатах по 2. \nКомнаты с мебелью и холодильником: \nв центре города у моря. Со всеми расходами, wifi, стиральная, белье, одеяла и подушки\n\nЖеня: ‭055-9713138‬\nWhatsapp +972‭55-9713138‬",
            "Тел": " 055 9713138‬",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "",
            "Район/Улица:": "Бен Гурион 99",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "6000 шек.",
            "fullText": "Двухкомнатная квартира в отеле Леонардо полностью мебелированная ,Интернет есть, на самом берегу моря, цена включает только аренду ,коммунальные услуги отдельно., БЕЗ МАКЛЕРА .тел хозяйки 0526502928 Нира, можно жить до 4 человек",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1888/188793_img_1284936.jpg",
              "http://static.doska.orbita.co.il/images/users/1888/188793_img_1284937.jpg",
              "http://static.doska.orbita.co.il/images/users/1888/188793_img_1284938.jpg",
              "http://static.doska.orbita.co.il/images/users/1888/188793_img_1284939.jpg",
              "http://static.doska.orbita.co.il/images/users/1888/188793_img_1284940.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Сдается КОЙКО-МЕСТО в центре города Бат-Ям рабочим и туристам – 1300 шек/мес. В квартире есть вся необходимая мебель, оборудованная \nкухня, wi-fi. Рядом море (3 мин пешком), автобусные остановки, банки, рынок, магазины. Не маклер!!! Тел. 054-6395646 0527563025 Дмитрий\n\nСдается комната на длительный срок в центре города Бат-Ям одному работающему человеку (без вредных привычек!!!). В комнате есть вся необходимая мебель, кухня полностью оборудованная, есть wi-fi,\nДом расположен возле моря Бат-Ям - рядом банки, рынок, магазины, автобусные остановки во все направления. Аренда 1900 шек/мес (все включено)\nТел. 054-6395646 Дмитрий",
            "Тел": " 054 6395646",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "в центре сдается 3.5 с половиной комнаты\nбез чеков могут обращаться репатрианты\nтуристы и беженцы \n\n053 520 47 85\nАлександра",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "1",
            "Этаж:": "1",
            "Мебель:": "частично",
            "Цена:": "2800 шек.",
            "fullText": "Сдаётся 1ком.кв.1этаж,мебель. Бат-ям центр.2800.",
            "Тел": " 02 0545517119",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "3",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "4000 шек.",
            "fullText": "Сдаётся 3ком.кв.2этаж,мебель. Бат-ям центр.4000.",
            "Тел": " 02 0545517119",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдается в БАТ ЯМЕ комната на подселения для работущего мужчины. Комната полностью мебелированая в очень хорошоем районе. 0503493030",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "квартира комната 3 ком. в центре\nсрочное решение КВАРТИРНОГО ВОПРОСА в том числе ДЛЯ ТУРИСТОВ \nсдается в аренду для туристов \nмебель\n053 520 47 85\nАлександра",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдается комната в квартире с двухспальной кроватью, рядом каньйон бат ям,для пары - цена 1250 шек. с одного человека включая все коммунальные расходы, есть все необходимое для жизни.\nНе Маклер.",
            "Тел": " 055 9535596",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдается койко место в комнате где 2 кровати, только для мужчин , цена 1200 шек в месяц, в квартире есть все необходимое для жизни. Находится рядом с каньйоном Бат ям.\nНе маклер.",
            "Тел": " 055 9535596",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Бялик",
            "Комнаты:": "2",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "3300 шек.",
            "fullText": "Сдается 2ком.квартира 65м.с ремонтом и мебелью по ул.Бялик,два мазгана,стоянка! тел.052-3902547",
            "Тел": " 052 3902547",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485805.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485806.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485807.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485808.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485809.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "28.12.2017",
            "Район/Улица:": "Даниель",
            "Комнаты:": "3",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "3800 шек.",
            "fullText": "Сдам 3к.85м.по ул.Даниель ,с мебелью и ремонтом,есть лифт и стоянка! \nтел.052-3902547",
            "Тел": " 052 3902547",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485800.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485801.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485802.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485803.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485804.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "район Рамат-Йосеф",
            "Комнаты:": "1",
            "Этаж:": "1",
            "Мебель:": "частично",
            "Цена:": "2200 шек.",
            "fullText": "Заезд с послезавтра 2 ян. , 1-комнатная НАСТОЯЩАЯ оригинал огромная 50 кв.м. КВАРТИРА !!! . , а Не студия и Не делёнка и не другое г.... ) ) . , ПОЛНОЦЕННАЯ . , соСвоейКухнейотдельнойНормальной . , санузел с Ванной !! . ; на 0-ом этаж двеступенькинаверх , решётки , место для дворикабольшого . ; сдаю в Бат Яме в райончике Рамат-Йосэф . ; кондиционер, холодильник , .. . ; ; 2200 шек., с чеками. 0522521807 Миша маклер !!!",
            "Тел": " 052 2521807",
            "images": []
          },
          {
            "type": " ",
            "city": "Весь Израиль",
            "date": "",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Kацнельсон",
            "Комнаты:": "1.5",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "2700 шек.",
            "fullText": "Сдается 1.5- комнатнaя квартира ,хорошая,красивая,с мебелью , 1-й этаж, недорого - 2700 шекелей ,улица Kацнельсон , на длительный срок,в Бат яме. Подходит ДЛЯ НОВЫХ РЕПАТРИАНТОВ, ТУРИСТОВ, БЕЖЕНЦЕВ И ТРУДОВЫХ МИГРАНТОВ. Teл .. 052-2837252",
            "Тел": " 052 2837252",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Kацнельсон",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдается 1.5- комнатнaя квартира ,хорошая,красивая,с мебелью , 1-й этаж,недорого - 2700 шекелей ,улица Kацнельсон , на длительный срок,в Бат яме. Подходит ДЛЯ НОВЫХ РЕПАТРИАНТОВ, ТУРИСТОВ, БЕЖЕНЦЕВ И ТРУДОВЫХ МИГРАНТОВ. Teл .. 052-2837252",
            "Тел": " 052 2837252",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Квартиры - сдам\nКвартиры - сдам\nтел 0507517271... ... ОПЛАТА 1500-..тел ТЕЛ 0507517271\n... . Квартиры - сдам 1 комната 1500 шек одну КОМНАТУ В ТРЕХ КОМНАТНОЙ КВАРТИРЕ ,РАБОТАЮЩЕЙ ЖЕНЩИНЕ ИЛИ ТУРИСТКИ. Квартира благоустроенна\n\nНаписать\n\nНаписать",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдается в БАТ ЯМЕ комната на подселения для работущего мужчины. Комната полностью мебелированая в очень хорошоем районе. 0503493030",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Массарик",
            "Комнаты:": "3",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "4000 шек.",
            "fullText": "Сдается у моря беженцам большая 3 комнатная квартира с ремонтом и полным комплектом мебели и техники до мелочей,ул.Массарик, за наличные.тел.052-3902547",
            "Тел": " 052 3902547",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485559.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485560.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485561.jpg",
              "http://static.doska.orbita.co.il/images/users/1641/164060_img_1485562.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Орт Исраель",
            "Комнаты:": "3.5",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Срочно сдаётся в городе Бат Ям, в хорошем тихом месте, на ул Орт Исраель, возле дома \"репатриантов\" - квартира 3.5 комнаты, ремонт, мебель, кондиционеры микроволновка холодильник стирал ка - заходи и живи!!!",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485508.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485509.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485510.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485511.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485512.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "аНивим",
            "Комнаты:": "3",
            "Этаж:": "7",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Срочно сдаётся в новом доме на ул. аНивим, угол Ицхак Саде, рядом с парком «Ганоир» 3-ох комнатная квартира с лифтом, на 7-ом этаже, 80 метров, полностью меблированная (есть все) с видом на море. Есть личная стоянка, квартира с евро ремонтом. Не упустите. 4500 шек. Вся информация и возможность посмотреть только после разговора!!! 0532315600",
            "Тел": " 053 4279943",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485503.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485504.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485505.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485506.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485507.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "2",
            "Мебель:": "Не указано",
            "Цена:": "1200 шек.",
            "fullText": "Сдам койко-место в красивой уютной квартире работающей женщине (девушке) адекватной и без вредных привычек. Мой номер 0559804529 Марина",
            "Тел": " 055 9804529",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ротшильд",
            "Комнаты:": "2",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Не упустите. Сдается в Бат яме 2-ох комнатная квартира, 1-ый этаж из 4-ти, 50 метров на ул. Ротшильд, в великолепном и чистом состоянии, после супер ремонтом, есть стоянка личная под домом, лифт. Квартира находится 7-ем минут от моря, рядом магазины, автобусные остановки, садики, школа. Есть кондиционеры, квартира полностью меблированная, включая все!!!, кроме света - по счетчику 0532315600",
            "Тел": " 053 2315600",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485498.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485499.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485500.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485501.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485502.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Бен Гурион",
            "Комнаты:": "2",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Если вы мечтаете жить на берегу и вдыхать лечебный морской воздух, мы предлагаем Вам на ул. Бен Гурион, в 2-ух комнатную квартиру, в двух минутах ходьбы от моря, 50 кв. м, имеется парковка для машины, 1-этаж, лифт, из окон открывается великолепный вид. Дизайнерское решение оформления квартиры не оставит Вас равнодушными. Евро ремонт, квартира полностью меблированная, вся бытовая техника, кондиционер. Сдается как на долгосрочной основе, так и на короткий срок. Контактный телефон 0547943456\nИз за границы Viber, what's app; +972543616735\nПосуточно в низу.",
            "Тел": " 054 7943456",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485493.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485494.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485495.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485496.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485497.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Арлозоров",
            "Комнаты:": "2",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Мы точно знаем как воплотить вашу мечту в реальность . Предлагаем Вам 2 х комнатную квартиру для аренды. Квартира расположена в городе Бат-ям, ул. Арлазоров в 5 минут хоть бы от моря,40кв метров,\n2эт, полностью меблирована,оборудована всей необходимой бытовой техникой,кондиционерами, кабельное телевидение, высокоскоростной интернет по всей квартире. Квартира сделана таким образом,чтобы вы ни о чем не беспокоились, просто въехали наслаждались жизнью.",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485485.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485486.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485487.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485488.jpg",
              "http://static.doska.orbita.co.il/images/users/1268/126838_img_1485489.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "Не указано",
            "Этаж:": "Не указано",
            "Мебель:": "Не указано",
            "Цена:": "Не указано",
            "fullText": "Сдаётся\nБат ям\n3 комнаты 2-ой этаж\nул. ницана\nесть кондиционер \nцена 3600\nДани 054-8096554.",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Жаботинский",
            "Комнаты:": "2",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "3200 шек.",
            "fullText": "Сдается для туристов и для граждан!!!\nв Бат яме, на улице Жаботинский, 1-эт, 2-комнаты, 35- метров, полностью меблированная + интернет, теле виденье. \"Минута от моря\" - 3200 шек.\nСрочно, не упустите!!!\nТак же в этом же доме, Только для туристов: 4-ох комнатная, после хорошего ремонта, паркет по всей квартире, полностью меблированная, техника, от вилки до ложки!!! \nДо 8-ми человек - по су точно - 100$\n0543579384",
            "Тел": " 054 3579384",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485450.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485451.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485452.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485453.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485454.jpg"
            ]
          },
          {
            "type": " ",
            "city": "Весь Израиль",
            "date": "",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Узиель",
            "Комнаты:": "1",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Срочно сдаётся в Бат Яме, на ул. Узиель, 1-этаж, 1-а комната, после ремонта, всё новое и меблированная, заходи и живи, есть всё для жизни!!! Рядом магазины, автобусы, море 10 минут ногами. Подходит туристам. Цена в не конкуренции, вся информация по телефону 0534279943 ватсап +972534279943",
            "Тел": " 053 4279943",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485440.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485441.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485442.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485443.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485444.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Шапира",
            "Комнаты:": "3",
            "Этаж:": "1",
            "Мебель:": "частично",
            "Цена:": "4200 шек.",
            "fullText": "Дорогие гости и жители Бат ям! Сдаётся 3 комнатная квартира на улице Шапира!!! 1 этаж!!Апартаменты с евро ремонтом, встроенной кухней, большой ванной комнатой! Очень уютная, просторная, светлая, чистая квартира, всего в 5 минутах от моря. Рядом вся инфраструктура. Детские сады, школы, банки, магазины. Сдаётся на долгий срок. 4.200\nМы ждём ваших заявок и подберем любой вариант для вашего комфорта!0584330613\n0546003375",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485435.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485436.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485437.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485438.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485439.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ротшильд",
            "Комнаты:": "1",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Станьте счастливым обладателем\nоднокомнатной кварта мы,расположенной на ул.Ротшильд,пересечение с ул.Бальфур. Удачное территориальное расположение позволит Вам оказаться через пять минут на берегу моря. Евро ремонт,вся необходимая бытовая техника, кондиционер, полностью меблирована. Квартира расположена на втором этаже четырехэтажного дома. Возможность как долгосрочной аренды, так и посуточной.\nКонтактный телефон 0543616735",
            "Тел": " 054 3616735",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485426.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485427.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485428.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485429.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485430.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Бальфур",
            "Комнаты:": "3",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Квартиры - сдам 3 комнаты\nПросторная трех комнатная квартира,общая площадь 100 кв.м на ул. Бальфор.,1 этаж Наличие всей необходимой бытовой техники, каждая комната имеет индивидуальный кондиционер. Высокоскоростной интернет wi-fi . Одним из неоспоримых преимуществ является пол из ламината . Полностью меблирована. Телевидение кабельное. Санузел отреставрирован и оборудован современной сантехникой. А доме имеется лифт и стоянка для машин. Вся инфраструктура,автобусные остановки,парковая зона,детские игровые площадки.Удачное территориальное расположение квартиры 15 минут прогулочным шагом до моря еще одно приятное достоинство квартиры.Квартира предлагается к сдаче на длительный срок.\nЗвоните! Вы будете приятно удивлены ценой! Вы можете просмотреть сотню объявлений,но остановитесь на этом, так как это ваш счастливый лотерейный билет! 3-х комнатная квартира по цене 2х комнатной!!!! есть возможность переслать фото квартиры!!! Срочно!!!\nКонтактный телефон 0543579384 или ватсап, вебер +972543579384",
            "Тел": " 054 3579384",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485418.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485419.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485420.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485421.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485422.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Бальфур",
            "Комнаты:": "2",
            "Этаж:": "4",
            "Мебель:": "да",
            "Цена:": "3500 шек.",
            "fullText": "Не упустите. Сдается в Бат яме 2-ох комнатная квартира, 4-ый этаж из 5-ти, 50 метров на ул. Бальфур, в великолепном и чистом состоянии, после супер ремонтом, есть стоянка личная под домом, лифт. Квартира находится рядом парком \"Ганоир\", 7-ем минут от моря, рядом магазины, автобусные остановки, садики, школа. Есть кондиционеры, квартира полностью меблированная, включая все!!!, кроме света - по счетчику 3500 шек. 0532315600",
            "Тел": " 053 2315600",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485411.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485412.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485413.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485414.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485415.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ротшильд",
            "Комнаты:": "1.5",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "2700 шек.",
            "fullText": "Срочно сдается в Бат яме, на ул. Ротшильд, 1.5-к, 2-ой этаж, 35-метров.\nКвартира полностью меблированная, после хорошего ремонта, возле моря. Не упустите 2700 шек. 0546003375",
            "Тел": " 054 7943456",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485405.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485406.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485407.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485408.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485409.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Не указано",
            "Комнаты:": "1",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "1000 шек.",
            "fullText": "Сдам комнату на подселение.В Бат яме парню или работающему мужчине с Украины на ул Герцель.Есть все необходимое.1000 с чел.",
            "Тел": " 053 9264379",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Пинкас",
            "Комнаты:": "3",
            "Этаж:": "2",
            "Мебель:": "частично",
            "Цена:": "Не указано",
            "fullText": "Не упустите!!! Срочно сдаётся в Бат Яме, на ул. Пинкас 3-ох комнатная квартира, на 2-ом этаже из 4-ох, после ремонта, 3 кондиционера, частично меблированная, 75 метров, стоянка в \"табу\".\nВся информация и данные по номеру 0584330613",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485398.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485399.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485400.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485401.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485402.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ротшильд",
            "Комнаты:": "2",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Ул. Ротшильд 2 этаж, 2-комнаты, ремонт с мебелью - полностью меблированная, кондиционеры газовая плитка 2 минуты от моря с хорошим ремонтом в квартире есть всё - \"Заходи и живи\" Сдаётся посуточно и на долгий срок цена не в конкуренции Не упустите 054357 9384 второстепенный номер +972547943456 Viber WhatsApp 24 часа в сутки отвечаю!!!",
            "Тел": " 054 3579384",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485393.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485394.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485395.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485396.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485397.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ацмаут",
            "Комнаты:": "2",
            "Этаж:": "3",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Краткосрочная аренда в великолепной квартире с ценой без конкуренции!!! Срочно сдаётся в Бат Яме на улице Ацмаут, квартира 2-ух комнатная на 3-ем этаже с лифтом, с евро ремонтом, на высоком уровне, 5-ть минут от моря, всё есть в квартире, включая интернет и теле виденье, заходи и живи!!! Все данные и информация по телефону. \n0534279943",
            "Тел": " 053 4279943",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485387.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485388.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485389.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485390.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485391.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Альпер",
            "Комнаты:": "3",
            "Этаж:": "Не указано",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "ул. Альпер сдается трехкомнатная квартира - включает в себя гостиную с кухней открытого типа, 2 спальни, отремонтированный санузел. Оборудование кухни: плита, холодильник, вытяжка, микроволновая печь,электро чайник, посуда. В спальне имеется постельное белье, полотенца. По всей квартире Wi-Fi, спутниковое телевидение. Квартира расположена в 100 метрах от превосходного песчаного пляжа и 200 м от необходимой инфраструктуры города . Является отличным предложением для семейного отдыха и для отдельных туристов .Сдача квартиры как на длительный срок, так и посуточно. За информацией обращаться по телефону 0532315600 what's app, viber",
            "Тел": " 053 2315600",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485382.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485383.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485384.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485385.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485386.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Рав Кукис",
            "Комнаты:": "2",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "3800 шек.",
            "fullText": "НЕ УПУСТИТЕ!!!\nНа улице РАВ КУКИС ( бывшая Соколов) Сдаётся 2 комнатная квартира! 2 этаж из четырёх. На длительный срок! НЕ ДЛЯ БЕЖЕНЦЕВ!!!\nЧистая, уютная, есть все! Хорошая мебель, большая кухня, кондиционеры,уютная спальня и комфортабельная гостиная. В 5 минутах от моря и пляжей, ресторанов, магазинов. 3.800 в месяц. Звоните, WhatsApp, Viber\n058 433 06 13\n054 7 943 456",
            "Тел": " 054 7943456",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485377.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485378.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485379.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485380.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485381.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Шай Агнон",
            "Комнаты:": "2",
            "Этаж:": "2",
            "Мебель:": "частично",
            "Цена:": "Не указано",
            "fullText": "Внимание! На долгий срок сдаётся 2 комнатная квартира на улице Шай Агнон. Квартира на втором этаже, частично меблирована, с хорошим ремонтом, чистая, уютная! Изюминка этой квартиры это огромный балкон со столиком! А так же расположение! 3 минуты от моря! В шаговой доступности магазины, парки, рестораны, остановки транспорта. Спешите звонить.\n0584330613 0546003375. есть видео youtu.be/APRNTqi_moI",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485365.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485366.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485367.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485368.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485369.jpg"
            ]
          },
          {
            "type": " ",
            "city": "Весь Израиль",
            "date": "",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ецель",
            "Комнаты:": "4",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Находка, не упустите - ВЕЛИКОЛЕПНАЯ КВАРТИРА!!!\nСрочно сдаётся в Бат яме, на ул. Ерцель/Ерушалаим. Квартира VIP класса, 1-ый этаж, 3 минуты от моря, после евро ремонта, 100 метров \n4-ох комнатная. Есть все от вилки до постели с плазмой и интернетом. \nВсе вопросы по телефону 0528143411",
            "Тел": " 053 4279943",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485354.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485355.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485356.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485357.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485358.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ёосефталь",
            "Комнаты:": "2",
            "Этаж:": "4",
            "Мебель:": "да",
            "Цена:": "3500 шек.",
            "fullText": "сдается в Бат яме на ул.Еосефталь 2-ух комнатная квартира, после отличного ремонта, есть лифт и кондиционер, все для жизни, полностью меблированная, на 4-ом этаже, 75 метров.\n3500 шек. 0547943456",
            "Тел": " 053 2315600",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485349.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485350.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485351.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485352.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485353.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ротшильд",
            "Комнаты:": "1",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "сдам отдельную комнату, без маклера. Подходит украинцам в ожидании статуса беженца. Центр Бат-Яма, чистая квартира, бытовая техника, мебель, кондиционер, интернет, к морю 5 мин.. Для жильцов возможна помощь в трудоустройстве без посредников. 054 4329695",
            "Тел": " 054 4329695",
            "images": []
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Бен Гурион",
            "Комнаты:": "2",
            "Этаж:": "1",
            "Мебель:": "да",
            "Цена:": "3500 шек.",
            "fullText": "Находка, не упустите!!! Сдаётся на ул. Бен Гурион, первая линия от моря, с великолепным видом!!! 2-ух комнатная квартира, 1-ый этаж, лифт, в квартире есть всё, включая интернет и теле виденье!!!\nСрочный въезд 3500 шек. - Всё включено - все налоги!!!",
            "Тел": " 054 7943456",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485339.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485340.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485341.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485342.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485343.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Эли Коин",
            "Комнаты:": "3.5",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Срочно. Сдаётся в Бат Яме на ул. Эли Коин, рядом с каньоном, после евро ремонта, полностью меблированная, 3.5 комнаты, 2-ой этаж из 4-ех,90-метров. Стоянка, магазины, садики, школа, банки, почта, рядом есть все. аренды для быстрых в решении до конца месяца) 0527911233",
            "Тел": " 058 4330613",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485334.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485335.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485336.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485337.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485338.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Мивца Синай",
            "Комнаты:": "2.5",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "Не указано",
            "fullText": "Сдается в Бат яме, на ул. Мивца Синай, 2.5-к, 2-ой этаж из 4-ох, 70 метров. Квартира после хорошего ремонта. Рядом с домом: школы, сады, магазины, банки, больничные кассы, автобусные остановки. Квартира частично меблированная, можно оговорить о продажи мебели.\nСрочно . 0546003392",
            "Тел": " 053 4279943",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485323.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485324.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485325.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485326.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485327.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Ерцог",
            "Комнаты:": "3",
            "Этаж:": "2",
            "Мебель:": "нет",
            "Цена:": "Не указано",
            "fullText": "Не упустите, впервые сдается, после кап ремонта, в тихом и спокойном месте 2-ой этаж из 3-х, 3-ох комнатная, пустая, есть кондиционер. ул. Ерцог, угол Даниель, 10-сять минут пешком от моря. Данные по телефону 0532315600",
            "Тел": " 053 2315600",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485313.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485314.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485315.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485316.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485317.jpg"
            ]
          },
          {
            "type": "  Квартиры - Сдам",
            "city": "Бат Ям",
            "date": "27.12.2017",
            "Район/Улица:": "Шапира",
            "Комнаты:": "2",
            "Этаж:": "2",
            "Мебель:": "да",
            "Цена:": "3500 шек.",
            "fullText": "Предлагаются к аренде уютные апартаменты в г.БАТ ЯМ по ул. ШАПИРА. Апартаменты находятся на 2 этаже четырехэтажного дома .В нескольких шагах от дома находится ирия, великолепная городская набережная с прекрасными пляжами в 5 минутах ходьбы. Рядом есть абсолютно вся инфраструктура, которая обеспечит комфортное проживание: бары,рестораны, продуктовые магазины,остановки общественного транспорта. Апартаменты меблированные, после ремонта, имеется кабельное телевидение. Бесплатный Wi-Fi. Стоимость аренды 3.500 ,дополнительно оплачивается вода,электричество. Сдача возможна на длительные и короткие сроки.\nТел.05 47 943 456\n054 3579384 Viber, what's app",
            "Тел": " 054 7943456",
            "images": [
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485307.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485308.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485309.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485310.jpg",
              "http://static.doska.orbita.co.il/images/users/1254/125385_img_1485311.jpg"
            ]
          }
        ],
        dataOrbitaHeaders: []
      }
    },
    methods: {
      getData: function () {
        let options = {
          method: 'get',
          url: '/getDataOrbita',
        };
        this.$http(options)
          .then(
            response => {
              console.log(response);
              try {
                this.dataOrbita = JSON.parse(response.body);
              }
              catch (err) {
                this.dataOrbita = response.body;
              }
              this.dataOrbitaHeaders = [];
              for (let i in this.dataOrbita[0]) {
                this.dataOrbitaHeaders.push(i);
              }
            },
            error => console.warn(error)
          )
          .catch(
            error => console.warn(error)
          );
        
      }
      
      
    },
    
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .orbita {
    position: relative;
    height: 99%;
  }
  
  h1, h2 {
    font-weight: normal;
  }
  
  ul {
    list-style-type: none;
    padding: 0;
    text-align: left;
  }
  
  li {
    display: block;
    margin: 0 10px;
    text-align: left;
    
  }
  
  a {
    color: #42b983;
  }
  
  td.text {
    text-align: left;
  }
  
  td.hours {
    text-align: right;
  }
  
  .buttons, .inputs {
    font-size: 24px;
    position: relative;
    width: 100%;
    display: inline-block;
  }
  
  .task, .hours, .url {
    display: inline-block;
    width: 25%;
  }
  
  .hours {
    width: 7%;
  }
  
  .fa-icon {
    width: auto;
    height: 1em; /* or any other relative font sizes */
    
    /* You would have to include the following two lines to make this work in Safari */
    max-width: 100%;
    max-height: 100%;
  }

</style>
